{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "agent_contact",
    "1": "auto_debit_setup",
    "2": "branch_locator",
    "3": "cancel_policy",
    "4": "change_address",
    "5": "change_email",
    "6": "change_language",
    "7": "change_mobile_number",
    "8": "change_payment_method",
    "9": "claim_status",
    "10": "download_policy",
    "11": "file_claim",
    "12": "forgot_policy_number",
    "13": "grace_period_query",
    "14": "loan_against_policy",
    "15": "payment_status",
    "16": "policy_benefits",
    "17": "policy_document_status",
    "18": "policy_status",
    "19": "policy_term_details",
    "20": "policy_transfer",
    "21": "policy_upgrade",
    "22": "premium_due",
    "23": "register_complaint",
    "24": "reinstatement_query",
    "25": "renew_policy",
    "26": "surrender_policy",
    "27": "tax_certificate",
    "28": "update_address",
    "29": "update_contact",
    "30": "update_nominee"
  },
  "initializer_range": 0.02,
  "label2id": {
    "agent_contact": 0,
    "auto_debit_setup": 1,
    "branch_locator": 2,
    "cancel_policy": 3,
    "change_address": 4,
    "change_email": 5,
    "change_language": 6,
    "change_mobile_number": 7,
    "change_payment_method": 8,
    "claim_status": 9,
    "download_policy": 10,
    "file_claim": 11,
    "forgot_policy_number": 12,
    "grace_period_query": 13,
    "loan_against_policy": 14,
    "payment_status": 15,
    "policy_benefits": 16,
    "policy_document_status": 17,
    "policy_status": 18,
    "policy_term_details": 19,
    "policy_transfer": 20,
    "policy_upgrade": 21,
    "premium_due": 22,
    "register_complaint": 23,
    "reinstatement_query": 24,
    "renew_policy": 25,
    "surrender_policy": 26,
    "tax_certificate": 27,
    "update_address": 28,
    "update_contact": 29,
    "update_nominee": 30
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.1",
  "vocab_size": 30522
}
